In [2]:
import pandas as pd
import numpy as np

from utils import (
    execute_query,
    create_table_from_df,
    read_sql_file,
    read_json_file
)

# Leer credenciales

In [ ]:
# {
#     "host" : "localhost",
#     "dbname" : "dvdrental",
#     "user" : "postgres",
#     "password" : "",
#     "port" : "5432"
# }

credenciales = read_json_file("credentials.json")

In [8]:
credenciales

{'host': 'localhost',
 'dbname': 'dvdrental',
 'user': 'postgres',
 'password': 'Agudelo1997',
 'port': '5432'}

# Queries

In [9]:
query = """
SELECT 
*
FROM film;
"""

df_resultado = execute_query(query, credenciales)

In [10]:
df_resultado

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,2013-05-26 14:50:58.951,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...
1,384,Grosse Wonderful,A Epic Drama of a Cat And a Explorer who must ...,2006,1,5,4.99,49,19.99,R,2013-05-26 14:50:58.951,[Behind the Scenes],'australia':18 'cat':8 'drama':5 'epic':4 'exp...
2,8,Airport Pollock,A Epic Tale of a Moose And a Girl who must Con...,2006,1,6,4.99,54,15.99,R,2013-05-26 14:50:58.951,[Trailers],'airport':1 'ancient':18 'confront':14 'epic':...
3,98,Bright Encounters,A Fateful Yarn of a Lumberjack And a Feminist ...,2006,1,4,4.99,73,12.99,PG-13,2013-05-26 14:50:58.951,[Trailers],'boat':20 'bright':1 'conquer':14 'encount':2 ...
4,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,2013-05-26 14:50:58.951,"[Deleted Scenes, Behind the Scenes]",'academi':1 'battl':15 'canadian':20 'dinosaur...
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Young Language,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,G,2013-05-26 14:50:58.951,"[Trailers, Behind the Scenes]",'administr':12 'boat':8 'boy':17 'databas':11 ...
996,997,Youth Kick,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,NC-17,2013-05-26 14:50:58.951,"[Trailers, Behind the Scenes]",'boat':22 'cat':11 'challeng':14 'drama':5 'ki...
997,998,Zhivago Core,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,NC-17,2013-05-26 14:50:58.951,[Deleted Scenes],'boy':16 'canadian':19 'compos':8 'core':2 'fa...
998,999,Zoolander Fiction,A Fateful Reflection of a Waitress And a Boat ...,2006,1,5,2.99,101,28.99,R,2013-05-26 14:50:58.951,"[Trailers, Deleted Scenes]",'ancient':19 'boat':11 'china':20 'discov':14 ...
999,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,2013-05-26 14:50:58.951,"[Trailers, Commentaries, Behind the Scenes]","'ark':2 'boy':12,17 'intrepid':4 'mad':8 'mona..."

In [11]:
sql_query = read_sql_file("queries/ejemplo1.sql")
df_resultado_2 = execute_query(sql_query, credenciales)

In [13]:
df_resultado_2

     film_id              title
0        133    Chamber Italian
1        384   Grosse Wonderful
2          8    Airport Pollock
3         98  Bright Encounters
4          1   Academy Dinosaur
..       ...                ...
995      996     Young Language
996      997         Youth Kick
997      998       Zhivago Core
998      999  Zoolander Fiction
999     1000          Zorro Ark

[1000 rows x 2 columns]

# Crear tablas

## Generar datos de prueba

In [15]:
# Generar 100 filas de datos
np.random.seed(42)  # Fijar semilla para reproducibilidad

num_rows = 100

data = {
    "sale_id": np.arange(1, num_rows + 1),  # IDs de 1 a 100
    "customer_id": np.random.randint(100, 110, size=num_rows),  # 10 clientes (100-109)
    "category": np.random.choice(["Electronics", "Clothes", "Books", "Home", "Beauty", "Food"], size=num_rows),
    "amount": np.random.randint(10, 1000, size=num_rows),  # Montos entre 10 y 1000
    "sale_date": pd.date_range(start="2024-01-01", periods=num_rows, freq="D")  # Fechas consecutivas
}

test_data = pd.DataFrame(data)

# Mostrar primeras filas
test_data.head()

   sale_id  customer_id     category  amount  sale_date
0        1          106         Home     229 2024-01-01
1        2          103      Clothes     575 2024-01-02
2        3          107  Electronics     864 2024-01-03
3        4          104         Food     745 2024-01-04
4        5          106       Beauty     234 2024-01-05

In [18]:
create_table_from_df(test_data,'datos_transaccionales',credenciales)

Tabla 'datos_transaccionales' creada exitosamente en PostgreSQL.

In [16]:
execute_query('SELECT * FROM datos_transaccionales limit 1;', credenciales)

   sale_id  customer_id category  amount            sale_date
0        1          106     Home     229  2024-01-01 00:00:00

In [ ]:
(
    test_data
    .sort_values('sale_date')
    [['sale_date','amount']]
    .head()
)

   sale_date  amount
0 2024-01-01     229
1 2024-01-02     575
2 2024-01-03     864
3 2024-01-04     745
4 2024-01-05     234

In [19]:
(
    test_data
    .sort_values('sale_date')
    ['amount']
    .rolling(2,1)
    .mean()
    .head()
)

0    229.0
1    402.0
2    719.5
3    804.5
4    489.5
Name: amount, dtype: float64

In [34]:
test_data.groupby(['category'])['amount'].mean().shape

(6,)

# Ejercicios

1. Numerar las ventas de cada cliente.

ðŸ“Œ Enunciado:
Queremos asignar un nÃºmero de fila a cada venta de un cliente en orden cronolÃ³gico. Usa ROW_NUMBER() para numerar cada venta de un cliente, ordenÃ¡ndolas por fecha de venta.

In [21]:
query = """
SELECT 
    *,
    ROW_NUMBER() OVER( PARTITION BY customer_id ORDER BY sale_date) as orden
FROM datos_transaccionales;
"""

ejercicio_1 = execute_query(query, credenciales)
ejercicio_1

    sale_id  customer_id     category  amount            sale_date  orden
0        22          100      Clothes     410  2024-01-22 00:00:00      1
1        26          100        Books     846  2024-01-26 00:00:00      2
2        52          100         Home     157  2024-02-21 00:00:00      3
3        79          100         Home     581  2024-03-19 00:00:00      4
4        84          100  Electronics     263  2024-03-24 00:00:00      5
..      ...          ...          ...     ...                  ...    ...
95       64          109        Books     788  2024-03-04 00:00:00      7
96       66          109  Electronics     962  2024-03-06 00:00:00      8
97       76          109  Electronics     153  2024-03-16 00:00:00      9
98       94          109       Beauty     217  2024-04-03 00:00:00     10
99       96          109  Electronics     413  2024-04-05 00:00:00     11

[100 rows x 6 columns]

In [24]:
(
    ejercicio_1
    .query('customer_id == 100')
    .sort_values('sale_date')
)

   sale_id  customer_id     category  amount            sale_date  orden
0       22          100      Clothes     410  2024-01-22 00:00:00      1
1       26          100        Books     846  2024-01-26 00:00:00      2
2       52          100         Home     157  2024-02-21 00:00:00      3
3       79          100         Home     581  2024-03-19 00:00:00      4
4       84          100  Electronics     263  2024-03-24 00:00:00      5
5       88          100         Home     169  2024-03-28 00:00:00      6
6       92          100        Books     668  2024-04-01 00:00:00      7

In [44]:
query = """
SELECT 
    customer_id,
    sale_date,
    amount,
    ROW_NUMBER() OVER (PARTITION BY customer_id ORDER BY sale_date)
FROM datos_transaccionales;
"""
ejercicio_1 = execute_query(query, credenciales)

In [51]:
(
    ejercicio_1
    .query('customer_id == 106')
    .sort_values('sale_date')
)

    customer_id            sale_date  amount  row_number
51          106  2024-01-01 00:00:00     229           1
52          106  2024-01-05 00:00:00     234           2
53          106  2024-01-08 00:00:00     647           3
54          106  2024-01-29 00:00:00     207           4
55          106  2024-02-04 00:00:00     618           5
56          106  2024-02-07 00:00:00     196           6
57          106  2024-02-18 00:00:00     972           7
58          106  2024-03-09 00:00:00     160           8
59          106  2024-03-21 00:00:00      11           9
60          106  2024-04-04 00:00:00     140          10
61          106  2024-04-07 00:00:00      63          11

2. Calcular el ranking de ventas por categorÃ­a.

ðŸ“Œ Enunciado:
Determina el ranking de ventas dentro de cada categorÃ­a, ordenando por monto de venta en orden descendente. Usa RANK() para asignar el puesto de cada venta dentro de su categorÃ­a.

In [28]:
query = """
SELECT 
    category,
    sale_date,
    amount,
    RANK() OVER (PARTITION BY category ORDER BY amount DESC)
FROM datos_transaccionales;
"""
ejercicio_2 = execute_query(query, credenciales)

In [ ]:
(
    ejercicio_2
    .query('category == "Home"')
    .sort_values('amount', ascending=False)
)

    sale_id  customer_id     category  amount            sale_date
70       71          107         Food     999  2024-03-11 00:00:00
64       65          101         Food     997  2024-03-05 00:00:00
29       30          103         Home     991  2024-01-30 00:00:00
48       49          106         Home     972  2024-02-18 00:00:00
44       45          109         Food     964  2024-02-14 00:00:00
..      ...          ...          ...     ...                  ...
97       98          106  Electronics      63  2024-04-07 00:00:00
9        10          104        Books      62  2024-01-10 00:00:00
86       87          102      Clothes      46  2024-03-27 00:00:00
88       89          107         Home      18  2024-03-29 00:00:00
80       81          106         Food      11  2024-03-21 00:00:00

[100 rows x 5 columns]

3.  Comparar el monto de cada venta con la anterior.

ðŸ“Œ Enunciado:
Para cada venta, queremos ver cuÃ¡nto vendiÃ³ un cliente en su venta anterior. Usa LAG() para obtener el monto de la venta anterior de cada cliente.

In [32]:
(
    ejercicio_1
    .query('customer_id == 100')
    .sort_values('sale_date')
)

    sale_id  customer_id     category  amount            sale_date
21       22          100      Clothes     410  2024-01-22 00:00:00
25       26          100        Books     846  2024-01-26 00:00:00
51       52          100         Home     157  2024-02-21 00:00:00
78       79          100         Home     581  2024-03-19 00:00:00
83       84          100  Electronics     263  2024-03-24 00:00:00
87       88          100         Home     169  2024-03-28 00:00:00
91       92          100        Books     668  2024-04-01 00:00:00

In [48]:
query = """
SELECT 
    *,
    avg(amount) OVER (PARTITION BY customer_id ORDER BY SALE_DATE ROWS BETWEEN 2 PRECEDING AND 1 FOLLOWING) as monto_anterior,
    LAG(sale_date) OVER (PARTITION BY customer_id ORDER BY sale_date) as fecha_anterior
FROM datos_transaccionales;
"""
ejercicio_3 = execute_query(query, credenciales)
ejercicio_3

,sale_id,customer_id,category,amount,sale_date,monto_anterior,fecha_anterior
0,22,100,Clothes,410,2024-01-22 00:00:00,628.0000000000000000,None
1,26,100,Books,846,2024-01-26 00:00:00,471.0000000000000000,2024-01-22 00:00:00
2,52,100,Home,157,2024-02-21 00:00:00,498.5000000000000000,2024-01-26 00:00:00
3,79,100,Home,581,2024-03-19 00:00:00,461.7500000000000000,2024-02-21 00:00:00
4,84,100,Electronics,263,2024-03-24 00:00:00,292.5000000000000000,2024-03-19 00:00:00
...,...,...,...,...,...,...,...
95,64,109,Books,788,2024-03-04 00:00:00,818.5000000000000000,2024-02-29 00:00:00
96,66,109,Electronics,962,2024-03-06 00:00:00,615.7500000000000000,2024-03-04 00:00:00
97,76,109,Electronics,153,2024-03-16 00:00:00,530.0000000000000000,2024-03-06 00:00:00
98,94,109,Beauty,217,2024-04-03 00:00:00,436.2500000000000000,2024-03-16 00:00:00
99,96,109,Electronics,413,2024-04-05 00:00:00,261.0000000000000000,2024-04-03 00:00:00

In [49]:
ejercicio_3.query('customer_id == 100')

,sale_id,customer_id,category,amount,sale_date,monto_anterior,fecha_anterior
0,22,100,Clothes,410,2024-01-22 00:00:00,628.0000000000000000,None
1,26,100,Books,846,2024-01-26 00:00:00,471.0000000000000000,2024-01-22 00:00:00
2,52,100,Home,157,2024-02-21 00:00:00,498.5000000000000000,2024-01-26 00:00:00
3,79,100,Home,581,2024-03-19 00:00:00,461.7500000000000000,2024-02-21 00:00:00
4,84,100,Electronics,263,2024-03-24 00:00:00,292.5000000000000000,2024-03-19 00:00:00
5,88,100,Home,169,2024-03-28 00:00:00,420.2500000000000000,2024-03-24 00:00:00
6,92,100,Books,668,2024-04-01 00:00:00,366.6666666666666667,2024-03-28 00:00:00

4. Calcular la suma acumulada de ventas por cliente

ðŸ“Œ Enunciado:
Queremos calcular la suma acumulada del monto de ventas por cliente en orden cronolÃ³gico. Usa SUM() con OVER() para obtener el total acumulado de cada cliente.

5. Obtener el promedio mÃ³vil de ventas por categorÃ­a

ðŸ“Œ Enunciado:
Calcula el promedio mÃ³vil de las Ãºltimas 3 ventas dentro de cada categorÃ­a. Usa AVG() con ROWS BETWEEN 2 PRECEDING AND CURRENT ROW para calcularlo.

In [60]:
test_data.head()

   sale_id  customer_id     category  amount  sale_date
0        1          106         Home     229 2024-01-01
1        2          103      Clothes     575 2024-01-02
2        3          107  Electronics     864 2024-01-03
3        4          104         Food     745 2024-01-04
4        5          106       Beauty     234 2024-01-05

In [70]:
query = """
SELECT 
    customer_id,
    sale_date,
    amount,
    AVG(amount) OVER (PARTITION BY customer_id ORDER BY sale_date ROWS BETWEEN 2 PRECEDING AND CURRENT ROW)
FROM datos_transaccionales;
"""
ejemplo3 = execute_query(query, credenciales)

In [ ]:
(
    ejemplo3
    .query('customer_id == 100') 
    .sort_values('sale_date')   
)

   customer_id            sale_date  amount                   avg
0          100  2024-01-22 00:00:00     410  410.0000000000000000
1          100  2024-01-26 00:00:00     846  628.0000000000000000
2          100  2024-02-21 00:00:00     157  471.0000000000000000
3          100  2024-03-19 00:00:00     581  528.0000000000000000
4          100  2024-03-24 00:00:00     263  333.6666666666666667
5          100  2024-03-28 00:00:00     169  337.6666666666666667
6          100  2024-04-01 00:00:00     668  366.6666666666666667

In [71]:
query = """
SELECT 
    customer_id,
    sale_date,
    amount,
    SUM(amount) OVER (PARTITION BY customer_id ORDER BY sale_date ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING)
FROM datos_transaccionales;
"""
ejemplo4 = execute_query(query, credenciales)

In [73]:
(
    ejemplo4
    .query('customer_id == 100')
    .sort_values('sale_date')
)

   customer_id            sale_date  amount   sum
0          100  2024-01-22 00:00:00     410  1256
1          100  2024-01-26 00:00:00     846  1413
2          100  2024-02-21 00:00:00     157  1584
3          100  2024-03-19 00:00:00     581  1001
4          100  2024-03-24 00:00:00     263  1013
5          100  2024-03-28 00:00:00     169  1100
6          100  2024-04-01 00:00:00     668   837

# Respuestas

1. 

```sql

SELECT 
    customer_id, 
    sale_id, 
    amount, 
    sale_date,
    ROW_NUMBER() OVER (PARTITION BY customer_id ORDER BY sale_date) AS sale_number
FROM sales;

```

2. 

```sql

SELECT 
    category, 
    sale_id, 
    amount, 
    RANK() OVER (PARTITION BY category ORDER BY amount DESC) AS sale_rank
FROM sales;

```

3. 

```sql

SELECT 
    customer_id, 
    sale_id, 
    amount, 
    sale_date,
    LAG(amount) OVER (PARTITION BY customer_id ORDER BY sale_date) AS previous_sale
FROM sales;


```

4. 

```sql

SELECT 
    customer_id, 
    sale_id, 
    amount, 
    sale_date,
    SUM(amount) OVER (PARTITION BY customer_id ORDER BY sale_date) AS cumulative_sales
FROM sales;

```

5. 

```sql

SELECT 
    category, 
    sale_id, 
    amount, 
    sale_date,
    AVG(amount) OVER (PARTITION BY category ORDER BY sale_date ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) AS moving_avg
FROM sales;


```